tutorials/surfaceTracking/interTrackFoam/sloshing2D/constant/faMesh/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5-dev                               |
|   \\  /    A nd           | Revision: 1535                                  |
|    \\/     M anipulation  | Web:      http://www.OpenFOAM.org               |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/faMesh";
    object      faMeshDefinition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

polyMeshPatches  1( freeSurface );

boundary
{
    left
    {
        type                patch;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  leftWall;
    }

    right
    {
        type                patch;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  rightWall;
    }

    frontAndBack
    {
        type                empty;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  frontAndBack;
    }
}


// ************************************************************************** //
